<?php
$language["ERR_NO_EMAIL"]="Πρέπει να γράψεις το ηλεκτρονικό ταχυδρομείο σου (eMail)";
$language["ERR_INV_EMAIL"]="Πρέπει να γράψεις έγκυρη διεύθυνση ηλεκτ. ταχ. (eMail)";
$language["ERR_NO_CAPTCHA"]="Πρέπει να γράψεις τον κωδικό εικόνας";
$language["IMAGE_CODE"]="Κωδικός εικόνας";
$language["SECURITY_CODE"]="Απάντηση στην ερώτηση";
$language["RECOVER_EMAIL_1"]="\nΚάποιος, ελπίζω εσύ, ζήτησες τον κωδικό για τον λογαριασμό που σχετίζεται με αυτή την ηλεκτρονική διεύθυνση (%s) να αλλάξει.\n\nΗ επιθυμία αρχικά προέρχεται απο %s.\n\nΕαν δεν το έκανες εσύ αγνόησε αυτό το ηλεκ. ταχ. (eMail) πΑρακαλώ μην απαντήσεις.\n\nαν θα επιθυμούσες να επιβεβαιώσεις αυτό το αίτημα παρακαλώ ακολούθησε αυτό το σύνδεσμο:\n\n%s\n\nΑφού το κάνεις αυτό, ο κωδικός σου θα αλλάξει και θα σου σταλεί πίσω μέσω ηλεκτ. ταχυδ.\n--\n%s";
$language["RECOVER_EMAIL_2"]="\nΣύμφωνα με το αίτημα σου δημιουργήσαμε ένα καινούριο κωδικό για το λογαριασμό σου.\n\nΕδώ είναι οι πληροφορίες που εχουμε τωρα για τον λογαριασμό:\n\n    Όνομα χρήστη: %s\n    Κωδικός: %s\n\nΜπορείς να κάνεις είσοδο στο %s\n\n--\n%s";
?>