<?php
$language["ERR_NO_EMAIL"]="Вы должны указать E-mail адресс";
$language["ERR_INV_EMAIL"]="Введите коректный E-mail адресс";
$language["ERR_NO_CAPTCHA"]="Введите код подтверждения картинки";
$language["IMAGE_CODE"]="Код Картинки";
$language["SECURITY_CODE"]="Ответьте на вопрос";
$language["RECOVER_EMAIL_1"]="\nКто то, надеямся Вы, запросил востонавление пароля для акаунта асоциированного с этим E-mail адрессом (%s).\n\nЭтот запрос составлен %s.\n\nЕсли Вы не делали этого, просто проигнорируйте этот E-mail. Пожалуйста не отвечайте на это письмо.\n\nЕсли этот запрос был отправлен Вами, пройдите по следующей ссылке:\n\n%s\n\nПосле того как Вы это сделаете, Ваш пароль будет обновлен и отправлен Вам обратно на E-mail.\n--\n%s";
$language["RECOVER_EMAIL_2"]="\nПо Вашему запросу мы сгенерировали для Вас новый пароль.\n\nАктуальная информация которую мы имеем о Вашем профиле:\n\n    Имя пользователя: %s\n    Пароль: %s\n\nВы можете зайти по адрессу %s\n\n--\n%s";
?>