<?php
// Language File for Sypex Dumper 2
$LNG = array(

// Информация о файле локализации
'ver'				=> 20004, // Для какой версии предназначен файл
'translated'		=> 'irakly (admin@nep.ge)', // Контакты переводчика
'name'				=> 'ქართული',

// Панель инструментов
'tbar_backup'		=> 'ექსპორტი',
'tbar_restore'		=> 'იმპორტი', 
'tbar_files'		=> 'ფაილები',
'tbar_services'		=> 'სერვისები',
'tbar_options'		=> 'ოფციები',
'tbar_createdb'		=> 'ბაზის შექმნა',
'tbar_connects'		=> 'დაკავშირება',
'tbar_exit'			=> 'გამოსვლა',

// Названия объектов в дереве
'obj_tables'		=> 'ცხრილები',
'obj_views'			=> 'წარმოდგენილი',
'obj_procs'			=> 'პროცედურები',
'obj_funcs'			=> 'ფუნქციები',
'obj_trigs'			=> 'ტრიგერები',
'obj_events'		=> 'მოვლენები',

// Экспорт
'zip_max'			=> 'მაქსიმუმი',
'zip_min'			=> 'მინიმუმი',
'zip_none'			=> 'შეკუმშვის  გარეშე',
'default'			=> 'default',
'combo_db'			=> 'მონაცემთა ბაზა:', 
'combo_charset'		=> 'კოდირექბა:', 
'combo_zip'			=> 'შეკუმშვა:', 
'combo_comments'	=> 'კომენტარები:',
'del_legend'		=> 'ავტოგანსაზღვრა, თუ:',
'del_date'			=> 'ფაილები %s -დღეზე მეტი ხნის არის',
'del_count'			=> 'ფაილების რაოდენობა მეტია %s-ზე',
'tree'				=> 'აირჩიეთ ობიექტი:',
'no_saved'			=> 'არ არის შენახული დავალებები',
'btn_save'			=> 'შენახვა',
'btn_exec'			=> 'შესრულება',

// Импорт	
'combo_file'		=> 'ფაილი:',
'combo_strategy'	=> 'აღდგენის სტრატეგია:',
'ext_legend'		=> 'დამატებითი ოფციები:',
'correct'			=> 'კოდირების კორექცია',
'autoinc'			=> 'გავანულოთ AUTO_INCREMENT',

// Лог
'status_current'	=> 'მიმდინარე სტატუსი:',
'status_total'		=> 'საერთო სტატუსი:',
'time_elapsed'		=> 'მსვლელობა:',
'time_left'			=> 'დარჩა:',
'btn_stop'			=> 'შეწყვეტა',
'btn_pause'			=> 'პაუზა',
'btn_resume'		=> 'გაგრძელება',
'btn_again'			=> 'განმეორება',
'btn_clear'			=> 'ლოგების დასუფთავება',

// Файлы
'btn_delete'		=> 'წაშლა',
'btn_download'		=> 'ჩამოტვირთვა',
'btn_open'			=> 'გახსნა',

// Сервисы
'opt_check'			=> 'შემოწმების ოფციები:',
'opt_repair'		=> 'აღდგენა:',
'btn_delete_db'		=> 'წაშლა',
'btn_check'			=> 'შემოწმება',
'btn_repair'		=> 'აღდგენა',
'btn_analyze'		=> 'ანალიზი',
'btn_optimize'		=> 'ოპტიმიზირება',

// Опции
'cfg_legend'		=> 'მთავარი პარამეტრები:',
'cfg_time_web'		=> 'შესრულების დრო web (წამი):',
'cfg_time_cron'		=> 'cron ში შესრულება(წამი):',
'cfg_backup_path'	=> 'backup კატალოგის მისამართი:',
'cfg_backup_url'	=> 'URL მისამართი backup:',
'cfg_globstat'		=> 'გლობალური სტატისტიკა:',
'cfg_extended'		=> 'გაფართოებული პარამეტრები:',
'cfg_charsets'		=> 'ფილტრი კოდირებისათვის:',
'cfg_only_create'	=> 'სტრუქტურის backup:',
'cfg_auth'			=> 'ავტორიზაციის ჯაჭვი:',
'cfg_confirm'		=> 'დადასტურების მოთხოვნა:',
'cfg_conf_import'	=> 'ბაზის იმპორტზე',
'cfg_conf_file'		=> 'ფაილის წაშლაზე',
'cfg_conf_db'		=> 'ბაზის წაშლაზე',

// Соединение
'con_header'		=> 'დაკავშირების პარამეტრები',
'connect'			=> 'კავშირი',
'my_host'			=> 'ჰოსტი:',
'my_port'			=> 'პორტი:',
'my_user'			=> 'მომხმარებელი:',
'my_pass'			=> 'პაროლი:',
'my_pass_hidden'	=> 'პაროლი არ არის მითითებული',
'my_comp'			=> 'პროტოკოლი შეკუმშვაზე',
'my_db'				=> 'მონაცემთა ბაზა:',
'btn_cancel'		=> 'გაუქმება',

// Сохранение задания
'sj_header'			=> 'მოქმედების შენახვა',
'sj_job'			=> 'დავალება',
'sj_name'			=> 'სახელი (ლათინურად):',
'sj_title'			=> 'აღწერა:',

// Создание БД
'cdb_header'		=> 'მონაცემთა ბაზის შექმნა',
'cdb_detail'		=> 'დეტალები',
'cdb_name'			=> 'სახელი:',
'combo_collate'		=> 'შედარება',
'btn_create'		=> 'შექმნა',

// Авторизация
'js_required'		=> 'JavaScript უნდა იყოს ჩართული',
'auth'				=> 'ავტორიზაცია',
'auth_user'			=> 'მომხმარებელი:',
'auth_remember'		=> 'შენახვაь',
'btn_enter'			=> 'შესვლა',
'btn_details'		=> 'დეტალები',

// Сообщения в логе
'not_found_rtl'		=> 'RTL-ფაილი არ  არსებობს',
'backup_begin'		=> 'ბაზის ექსპორტის დასაწყისი `%s`',
'backup_TC'			=> 'ცხრილის ექსპორტი `%s`',
'backup_VI'			=> 'მოქმედების ექსპორტი `%s`',
'backup_PR'			=> 'პროცედურის ექსპორტი `%s`',
'backup_FU'			=> 'ფუნქციების ექსპორტი `%s`',
'backup_EV'			=> 'მოქმედების ექსპორტი `%s`',
'backup_TR'			=> 'ტრიგგერის ექსპორტი `%s`',
'continue_from'		=> 'პოზიციიდან %s',
'backup_end'		=> 'მონაცემთა ბაზის კოპიო `%s` შეიქმნა.',
'autodelete'		=> 'Автоудаление старых файлов:',
'del_by_date'		=> '- `%s` - წაიშალა',
'del_by_count'		=> '- `%s` - წაიშალა',
'del_fail'			=> '- `%s` - არ წაიშალა',
'del_nothing'		=> '- არ არის წასაშლელი ფაილები',
'set_names'			=> 'კოდირების კავშირის დაყენება: `%s`',
'restore_begin'		=> 'ბაზის იმპორტი `%s`',
'restore_TC'		=> 'ცხრილის იმპორტი `%s`',
'restore_VI'		=> 'წარმოდგენის იმპორტი `%s`',
'restore_PR'		=> 'პროცედურის იმპორტი `%s`',
'restore_FU'		=> 'ფუნქციის იმპორტი `%s`',
'restore_EV'		=> 'მოქმედების იმპორტი `%s`',
'restore_TR'		=> 'ტრიგგერის იმპორტი `%s`',
'restore_keys'		=> 'ინდექსის ჩართვა',
'restore_end'		=> 'ბაზა `%s` აღდგენილია სარეზერვო კოპიოდან.',
'stop_1'			=> 'მოქმედება გაუქმდა', 
'stop_2'			=> 'მოქმედება შეჩერებულია',
'stop_3'			=> 'მოქმედება შეჩერებულია ტაიმერით',
'stop_4'			=> 'მოქმედება გაჩერებულია ტაიმერით',
'stop_5'			=> 'მოქმედება შეჩერებულია',
'job_done'			=> 'მოქმედება შესრულდა',
'file_size'			=> 'ფაილის ზომა',
'job_time'			=> 'დახარჯული დრო',
'seconds'			=> 'წამი',
'job_freeze'		=> 'პროცესი არ განახლდება 30 წამში. დააჭირეთ გაგრძელებას',
'stop_job'			=> 'მოთხოვნა შეჩერებაზე',

// Надписи в JS
'js' => array(

	// Названия вкладок
	'backup'		=> 'მონაცემთა ბაზის ექსპორტი',
	'restore'		=> 'მონაცემთა ბაზის იმპორტი',
	'log'			=> 'მოქმედების ლოგები',
	'result'		=> 'შესრულების შედეგი',
	'files'			=> 'სარეზერვო ფაილების კოპიო',
	'services'		=> 'სერვისები',
	'options'		=> 'ოფციები',

	// Заголовки таблиц
	'dt'			=> 'თარიღი',
	'action'		=> 'მოქმედება',
	'db'			=> 'მონაცემთა ბაზა',
	'type'			=> 'ტიპი',
	'tab'			=> 'ცხრილი',
	'records'		=> 'ჩანაწერი',
	'size'			=> 'ზომა',
	'comment'		=> 'კომენტარები',
	
	// Статусы
	'load'			=> 'Loading',
	'run'			=> 'შესრულება...',
	'sdb'			=> 'მონაცემთა ბაზის შექმნა',
	'sc'			=> 'დაკავშირების შენახვა',
	'sj'			=> 'დავალების შენახვა',
	'so'			=> 'ოფციების შენახვა',

	// Сообщения
	'pro'			=> 'ოფცია მისაწვდომია მხოლოდ პრო ვერსიასთვის',
	'err_fopen'		=> 'არ მოხერხდა ფაილის გასხნა',
	'err_sxd2'		=> 'ამ ფაილის ნასხვა შესაძლებელია მხოლოდ Sypex Dumper 2-ის მიერ',
	'err_empty_db'	=> 'მონაცემთა ბაზა ცარიელია',
	'fdc'			=> 'ნამდვილად გინდა წაშალა?',
	'ddc'			=> 'ნამდვილად გინდა მონაცემთა ბაზის წაშალა?',
	'fic'			=> 'ნამდვილად გინდა ფაილის იმპორტი(?',

	// Сокращения размеров файла
	'sizes'			=> array('ბ', 'კკბ', 'მბ', 'გბ'),
)
);
?>
