<?php
// Language File for Sypex Dumper 2
$LNG = array(

// Информация о файле локализации
'ver'				=> 20004, // Для какой версии предназначен файл
'translated'		=> 'dark_kz (http://darkspace.kz/)', // Контакты переводчика
'name'				=> 'Қазақша', // Название языка

// Панель инструментов
'tbar_backup'		=> 'Экспорт',
'tbar_restore'		=> 'Импорт', 
'tbar_files'		=> 'Файлдар',
'tbar_services'		=> 'Сервистер',
'tbar_options'		=> 'Опциялар',
'tbar_createdb'		=> 'ДБ құру',
'tbar_connects'		=> 'Қосылуы',
'tbar_exit'			=> 'Шығу',

// Названия объектов в дереве
'obj_tables'		=> 'Кестелер',
'obj_views'			=> 'Көрсетілімдер',
'obj_procs'			=> 'Процедуралар',
'obj_funcs'			=> 'Функциялар',
'obj_trigs'			=> 'Триггерлер',
'obj_events'		=> 'Оқиғалар',

// Экспорт
'zip_max'			=> 'максимум',
'zip_min'			=> 'минимум',
'zip_none'			=> 'Сығусыз',
'default'			=> 'Келісім бойынша',
'combo_db'			=> 'Деректер базасы:', 
'combo_charset'		=> 'Кодталуы:', 
'combo_zip'			=> 'Сығыдым:', 
'combo_comments'	=> 'Комментарий:',
'del_legend'		=> 'Автоөшіру, егер:',
'del_date'			=> 'файлдарға %s күннен артық',
'del_count'			=> 'файлдар саны %s көп',
'tree'				=> 'Объектті таңдаңыз:',
'no_saved'			=> 'Сақталынған тапсырмалар жоқ',
'btn_save'			=> 'Сақтау',
'btn_exec'			=> 'Жүктеу',

// Импорт	
'combo_file'		=> 'Файыл:',
'combo_strategy'	=> 'Қайта қалпына құру стратегиясы:',
'ext_legend'		=> 'Қосымша опциялар:',
'correct'			=> 'Кодталуды түзету',
'autoinc'			=> 'AUTO_INCREMENT-ті нөлдету',

// Лог
'status_current'	=> 'Ағымды жағдайы:',
'status_total'		=> 'Жалпы жағдайы:',
'time_elapsed'		=> 'Өткен уақыт:',
'time_left'			=> 'Қалған уақыт:',
'btn_stop'			=> 'Үзіп тастау',
'btn_pause'			=> 'Үзіліс қою',
'btn_resume'		=> 'Жалғастыру',
'btn_again'			=> 'Қайтадан істеу',
'btn_clear'			=> 'Логты тазарту',

// Файлы
'btn_delete'		=> 'Өшіру',
'btn_download'		=> 'Жүктеп алу',
'btn_open'			=> 'Ашу',

// Сервисы
'opt_check'			=> 'Тексеру опциялары:',
'opt_repair'		=> 'Оңдау опциялары:',
'btn_delete_db'		=> 'ДБ өшіру',
'btn_check'			=> 'Тексеру',
'btn_repair'		=> 'Оңдау',
'btn_analyze'		=> 'Талдау жасау',
'btn_optimize'		=> 'Оңтайландыру',

// Опции
'cfg_legend'		=> 'Негізгі баптамалар:',
'cfg_time_web'		=> 'web-те орындалу уақыты (сек.):',
'cfg_time_cron'		=> 'cron-да орындалу уақыты (сек.):',
'cfg_backup_path'	=> 'backup каталогына жол:',
'cfg_backup_url'	=> 'backup каталогына сілтеме (URL):',
'cfg_globstat'		=> 'Ауқымды статистика:',
'cfg_extended'		=> 'Кеңейтілген баптамалар:',
'cfg_charsets'		=> 'Кодталу фильтрлері:',
'cfg_only_create'	=> 'Тек қана құрылымның бэкапы:',
'cfg_auth'			=> 'Авторландыру жолы:',
'cfg_confirm'		=> 'Операцияларға растауды міндеттеу:',
'cfg_conf_import'	=> 'ДБ импорты үшін',
'cfg_conf_file'		=> 'файылды өшіру үшін',
'cfg_conf_db'		=> 'ДБ өшіру үшін',

// Соединение
'con_header'		=> 'Қосылудың параметрлері',
'connect'			=> 'Қосылым',
'my_host'			=> 'Хост:',
'my_port'			=> 'Порт:',
'my_user'			=> 'Қолданушы:',
'my_pass'			=> 'Құпия сөз:',
'my_pass_hidden'	=> 'Құпия сөз не показан',
'my_comp'			=> 'Протокол сығылыммен',
'my_db'				=> 'Деректер базасы:',
'btn_cancel'		=> 'Болдырмау',

// Сохранение задания
'sj_header'			=> 'Тапсырманы сақтау',
'sj_job'			=> 'Тапсырма',
'sj_name'			=> 'Аты (ағылшынша):',
'sj_title'			=> 'Сипаттамасы:',

// Создание БД
'cdb_header'		=> 'Деректер базаны құру',
'cdb_detail'		=> 'Детальдер',
'cdb_name'			=> 'Аталым:',
'combo_collate'		=> 'Салыстырым',
'btn_create'		=> 'Құру',

// Авторизация
'js_required'		=> 'JavaScript қосылуы міндетті',
'auth'				=> 'Авторизация',
'auth_user'			=> 'Қолданушы:',
'auth_remember'		=> 'Есте сақтау',
'btn_enter'			=> 'Кіру',
'btn_details'		=> 'Детальдер',

// Сообщения в логе
'not_found_rtl'		=> 'RTL-файлы табылған жоқ',
'backup_begin'		=> '`%s` ДБ экспорт басталуы',
'backup_TC'			=> '`%s` кестенің экспорты',
'backup_VI'			=> '`%s` көрсетілім экспорты',
'backup_PR'			=> '`%s` процедураның экспорты',
'backup_FU'			=> '`%s` функцияның экспорты',
'backup_EV'			=> '`%s` оқиғасының экспорты',
'backup_TR'			=> '`%s` триггердің экспорты',
'continue_from'		=> '%s позициядан бастап',
'backup_end'		=> '`%s` ДБ резервті копиясы құрылды.',
'autodelete'		=> 'Көне файлдардың автоөшірілуі:',
'del_by_date'		=> '- `%s` - өшірілген (дата бойынша)',
'del_by_count'		=> '- `%s` - өшірілген (дата бойынша)',
'del_fail'			=> '- `%s` - өшіре алмадым',
'del_nothing'		=> '- өшіруге файлдар табылған жоқ',
'set_names'			=> 'Қосылудың кодталуы `%s` етіп қойлған:',
'restore_begin'		=> '`%s` ДБ импорттың басталуы',
'restore_TC'		=> '`%s` кестенің импорты',
'restore_VI'		=> '`%s` көрсетілім импорты',
'restore_PR'		=> '`%s` процедураның импорты',
'restore_FU'		=> '`%s` функцияның импорты',
'restore_EV'		=> '`%s` оқиғасының импорты',
'restore_TR'		=> '`%s` триггердің импорты',
'restore_keys'		=> 'Индекстердің қосылуы (кірістіру)',
'restore_end'		=> '`%s` ДБ резервті копиядан қайта құрылды.',
'stop_1'			=> 'Орындалуды қолданушы үзіп тастады', 
'stop_2'			=> 'Орындалу қолданушы тоқтатты',
'stop_3'			=> 'Орындалу таймер бойынша тоқтатылды',
'stop_4'			=> 'Орындалу таймаут бойынша тоқтатылды',
'stop_5'			=> 'Орындалу қатенің кедергісінен тоқтатылды',
'job_done'			=> 'Тапсырма сәтті орындалды',
'file_size'			=> 'Файыл көлеім',
'job_time'			=> 'Жұмсалған уақыты',
'seconds'			=> 'сек.',
'job_freeze'		=> 'Процесс 30 секундтен гөрі жаңартылмаған. Жалғастыруды басыңыз',
'stop_job'			=> 'Тоқтатуға сұраным жасау',

// Надписи в JS
'js' => array(

	// Названия вкладок
	'backup'		=> 'Деректер базасын экспорттау',
	'restore'		=> 'Деректер базасын импорттау',
	'log'			=> 'Жасалған амалдар логы',
	'result'		=> 'Орындалудың нәтижесі',
	'files'			=> 'Резервті файылдар тізімі',
	'services'		=> 'Сервистер',
	'options'		=> 'Опциялар',

	// Заголовки таблиц
	'dt'			=> 'Дата және уақыт',
	'action'		=> 'Амал',
	'db'			=> 'Деректер базасы',
	'type'			=> 'Тип',
	'tab'			=> 'Кесте',
	'records'		=> 'Жазбалар',
	'size'			=> 'Көлем',
	'comment'		=> 'Комментарий',
	
	// Статусы
	'load'			=> 'Жүктелім',
	'run'			=> 'Орындалу...',
	'sdb'			=> 'Деректер базасының құрылуы',
	'sc'			=> 'Қосылудың сақталуы',
	'sj'			=> 'Тапсырманың сақталуы',
	'so'			=> 'Опциялардың сақталуы',

	// Сообщения
	'pro'			=> 'Опция тек қана Pro-версиясында бар',
	'err_fopen'		=> 'Файылда аша алмадым',
	'err_sxd2'		=> 'Файылдың мазмұнын (ішін) қарау тек қана Sypex Dumper 2 құрған файылдарға тән',
	'err_empty_db'	=> 'Деректер базасы бос',
	'fdc'			=> 'Сіз файылды шын мәнінде өшіргіңіз келе ме?',
	'ddc'			=> 'Сіз деректер базасын шын мәнінде өшіргіңіз келе ме?',
	'fic'			=> 'Сіз файылды шын мәнінде импорттағыңыз келе ме?',

	// Сокращения размеров файла
	'sizes'			=> array('Б', 'КБ', 'МБ', 'ГБ'),
)
);
?>
