<?php
$language["ERR_NO_EMAIL"]="Трябва да въведете e-mail адрес";
$language["ERR_INV_EMAIL"]="Трябва да въведете валиден e-mail адрес";
$language["ERR_NO_CAPTCHA"]="Трябва да въведете кода от картинката";
$language["IMAGE_CODE"]="Код";
$language["SECURITY_CODE"]="Отговорете на въпроса";
$language["RECOVER_EMAIL_1"]="\nНякой, надяваме се Вие, поиска парола за акаунт, свързан с този email адрес (%s), да бъде подновена.\n\nЗаявката е от %s.\n\nАко не сте Вие, моля, не отговаряйте на това писмо.\n\nАко искате да потвърдите, моля цъкнете на линка:\n\n%s\n\nСлед това паролата ще бъде подновена и изпратена обратно на Вас.\n--\n%s";
$language["RECOVER_EMAIL_2"]="\nПо ваша заявка беше генерирана нова парола.\n\nТова е информацията за Вашия акаунт:\n\n    Потребителско име: %s\n    Нова парола: %s\n\nМожете да влезете на %s\n\n--\n%s";
?>