<?php
$language['ERR_NO_EMAIL']='عليك تقديم بريد الكتروني';
$language['ERR_INV_EMAIL']='عليك ادخال بريد الكتروني صالح تاكد انك كتبت البريد بشكل صحيح';
$language['ERR_NO_CAPTCHA']='عليك ادخال النص الذي في الصورة كما هو';
$language['IMAGE_CODE']='نص الصورة';
$language['SECURITY_CODE']='اجب على السوال';
$language['RECOVER_EMAIL_1']="\n".'هناك شخص ،نرجوا ان تكون هو، طلب اعادة تكوين كلمة السر للحساب المرتبط بهذا البريد (%s) .'."\n\n".'الطلب قدم من %s.'."\n\n".'اذا لم تكن انت من قدم الطلب الرجاء تجاهل هذه الرسالة الرجاء عد ارسال اي رد على هذه الرسالة.'."\n\n".'لكن اذا كان انت من قدم هذا الطلب الرجاء الكبس على الوصلة التالية:'."\n\n".'%s'."\n\n".'بعد الكبس على الوصلة سيتم اعادت تعيين كلمة السر وارسال كلمة السر الجديدة الى بريدك'."\n--\n".'%s';
$language['RECOVER_EMAIL_2']="\n".'على حسب طلبك تم ارسال كلمة سر جديدة.'."\n\n".'هذه هي المعلومات التي لدينا تحت حسابك:'."\n\n\t".'User name: %s'."\n\n\t".'Password: %s'."\n\n".'يمكنك تسجيل الدخول في %s'."\n\n--\n".'%s';
?>